var _bData = [
    { "exdz": '[0-9]', "nam": ' أرقام ' },
    { "exdz": ' ', "nam": ' مسافات ' },
    { "exdz": '[\u0600-\u06FF]', "nam": ' أحرف عربية ' },
    { "exdz": '[a-zA-Z]', "nam": ' أحرف انجليزية ' },
    { "exdz": '[@|#|$|%|=|&|*|(|)|{|}|:|/|\\>|\<]', "nam": ' رموز و فواصل ' },
    { "exdz": `[.]`, "nam": ' نقطة فاصل ' },
    { "exdz": `[?]`, "nam": ' علامة استفهام ' },
    { "exdz": `[']`, "nam": " علامة اقتباس [ ' ]" },
    { "exdz": `["]`, "nam": ' علامة اقتباس [ " ]' },
    { "exdz": '[`]', "nam": ' علامة اقتباس [ ` ]' },
    { "exdz": '[,]', "nam": ' فاصلة [ , ] ' },
    { "exdz": '[!]', "nam": ' علامة تعجب ' },
    { "exdz": '[;]', "nam": ' فاصلة منقوطة [ ; ]' },
    { "exdz": '[+]', "nam": ' علامة جمع ' },
    { "exdz": '[-]', "nam": ' علامة ناقص ' },
    { "exdz": '[\\]|\[]', "nam": ' أقواس مربعة ' },
    { "exdz": '\n', "nam": ' سطور ' },
    { "exdz": false, "nam": ' أزالة الاقتباسات ', "ex": true, "eo": '[\[+(?=0|1|2|3|4|5|6|7|8|9|٠|٩|٨|٧|٦|٥|٤|٣|٢|١)\]+]' },
    { "exdz": false, "nam": ' ( العربية ) معالجة الكلمات ', "ex": false, "eo": [['مرحبا', 'هاي'], ["كيف حالك", "كيف هو حالك"]] },
    { "exdz": false, "nam": ' ( العربية ) معالجة الجمل ', "ex": false, "eo": [['لا تحتوي', 'لا تمتلك'], ["لا يستطيع", "لا يقدر"]] }
]

function bofpof(x) {
    if(x === true){
        // meam get data
        return _bData
    } else if(x === false){
        // mean push data
    }
}

module.exports= {
    bofpof
}